Revit 2026 API

# ElementTransformUtilsCanMirrorElements Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool CanMirrorElements(
	Document ADoc,
	ICollection<ElementId> elemIds
)
```
```vb
Public Shared Function CanMirrorElements (
	ADoc As Document,
	elemIds As ICollection(Of ElementId)
) As Boolean
```
```cpp
public:
static bool CanMirrorElements(
	Document^ ADoc,
	ICollection<ElementId^>^ elemIds
)
```
```fsharp
static member CanMirrorElements :
        ADoc : Document *
        elemIds : ICollection<ElementId> -> bool
```

#### Parameters

ADoc Document

elemIds ICollectionElementId

#### Return Value

Boolean

#### Reference

ElementTransformUtils Class

Autodesk.Revit.DB Namespace